const y_suelo_fichas = 361.3
const y_suelo_personajes = 205
const pos_casa = {
    "rojo": [[0, 92],
    [0, 84],
    [0, 75],
    [0, 65.7],
    [0, 57.5],
    [0, 49],
    [0, 40.5],
    [0, 25.5]],
    "verde": [[-101.5, 0],
    [-92.8, 0],
    [-83.9, 0],
    [-74.8, 0],
    [-65.7, 0],
    [-56.6, 0],
    [-48, 0],
    [-39.5, 0],
    [-24.5, 0]],
    "amarillo": [[0, -92],
    [0, -84],
    [0, -75],
    [0, -65.7],
    [0, -57.5],
    [0, -49],
    [0, -40.5],
    [0, -25.5]],
    "azul": [[92.8, 0],
    [83.9, 0],
    [74.8, 0],
    [65.7, 0],
    [56.6, 0],
    [48, 0],
    [39.5, 0],
    [24.5, 0]]
}
const pos = [
    [23.1, 65.7, true],
    [23.1, 57.5],
    [23.1, 49],
    [23.1, 40.5],
    [39.5, 23.1],
    [48, 23.1],
    [56.6, 23.1],
    [65.7, 23.1, true],
    [74.8, 23.1],
    [83.9, 23.1],
    [92.8, 23.1],
    [101.5, 23.1],
    [101.5, 0, true],
    [101.5, -23.1],
    [92.8, -23.1],
    [83.9, -23.1],
    [74.8, -23.1],
    [65.7, -23.1, true],
    [56.6, -23.1],
    [48, -23.1],
    [39.5, -23.1],
    [23.1, -40.5],
    [23.1, -49],
    [23.1, -57.5],
    [23.1, -65.7, true],
    [23.1, -75],
    [23.1, -84],
    [23.1, -92],
    [23.1, -101],
    [0, -101, true],
    [-23.1, -101],
    [-23.1, -92],
    [-23.1, -84],
    [-23.1, -75],
    [-23.1, -65.7, true],
    [-23.1, -57.5],
    [-23.1, -49],
    [-23.1, -40.5],
    [-39.5, -23.1],
    [-48, -23.1],
    [-56.6, -23.1],
    [-65.7, -23.1, true],
    [-74.8, -23.1],
    [-83.9, -23.1],
    [-92.8, -23.1],
    [-101.5, -23.1],
    [-101.5, 0, true],
    [-101.5, 23.1],
    [-92.8, 23.1],
    [-83.9, 23.1],
    [-74.8, 23.1],
    [-65.7, 23.1, true],
    [-56.6, 23.1],
    [-48, 23.1],
    [-39.5, 23.1],
    [-23.1, 40.5],
    [-23.1, 49],
    [-23.1, 57.5],
    [-23.1, 65.7, true],
    [-23.1, 75],
    [-23.1, 84],
    [-23.1, 92],
    [-23.1, 101],
    [0, 101, true],
    [23.1, 101],
    [23.1, 92],
    [23.1, 84],
    [23.1, 75]
]

const creditsText = `
=====================
Parchís simplificado
=====================

Implementado utilizando principalmente la biblioteca Three.js

Creado por Raúl Balanzá García como trabajo final de la asignatura GPC del MIARFID en la UPV.

Modelos utilizados:

- Dado, de macriciox
- Ficha, de Adam.Klimo
- Tablero, de PJ
- Mesa y sillas de jardín, de anDDDres
- Personajes, de micaelsampaio
- Habitación y textura del suelo, de Humus
- Capybaras, de Ear.Rodriguez
- Flores, de Luis Gustavo, Kon e Izzy
`

export { pos_casa, pos, y_suelo_fichas, y_suelo_personajes, creditsText }